Documents/Renault_ЗаявкаНаКредит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ЗаявкаНаКредит</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаБанка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальныйВзносПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальныйВзнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжемесячныйПлатеж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_CRM_СтатусЗаявокНаКредит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитноеПредложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КредитныеПредложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьАвтомобиля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияРасчета</Name>
					<Comment>Структура (СтрокаВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/Renault_CRM_СтатусЗаявокНаКредит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_CRM_СтатусЗаявокНаКредит</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Одобрена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_ЗаявкаНаКредит/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Автор.Пустая() Тогда Объект.Автор=ПараметрыСеанса.Пользователь КонецЕсли;
	Если Объект.ДилерскийЦентр.Пустая() Тогда Объект.ДилерскийЦентр=ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр КонецЕсли;
	Если Объект.Состояние.Пустая() Тогда Объект.Состояние=Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Черновик КонецЕсли;
	//УправлениеЭлементами();
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ) УправлениеЭлементами() КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) Оповестить("ОбновитьВоронку"); Оповестить("ОбновитьСписок"); УправлениеЭлементами() КонецПроцедуры

Процедура УправлениеЭлементами()
	Элементы.кнСостояние.Заголовок="Состояние:"+Символы.ПС+Объект.Состояние;	
	//Элементы.ЗаголовокФормы.Заголовок="Заявка на кредит в банк ("+Нрег(Объект.Состояние)+")";
	Заголовок="Заявка на кредит в банк ("+Нрег(Объект.Состояние)+")";
	Элементы.Версия.СписокВыбора.ЗагрузитьЗначения(Renault_ОбщиеФункции.ВариантыКомплектаций(Объект.Автомобиль));
	
	//Массив=Новый Массив; 
	//Массив.Добавить(Новый ПараметрВыбора("Отбор.Владелец",Объект.Банк));
	//Элементы.КредитноеПредложение.ПараметрыВыбора=Новый ФиксированныйМассив(Массив);
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьСостояние(Состояние="")
	Если ТипЗнч(Состояние)=Тип("КомандаФормы") Тогда
		Состояния=Новый СписокЗначений;
		Для Каждого Эл Из Перечисления.Renault_CRM_СтатусЗаявокНаКредит Цикл Состояния.Добавить(Эл) КонецЦикла;	
		Состояния.НайтиПоЗначению(Объект.Состояние).Пометка=Истина;

		Парам=Новый Структура;
		Парам.Вставить("Список",Состояния);
		Парам.Вставить("Заголовок","Состояние заявки");
		Парам.Вставить("МножественныйВыбор",Ложь);
		//Парам.Вставить("КоличествоЭлементовВСтроке",3);
		Парам.Вставить("ШиринаЭлемента",14);
		Парам.Вставить("ВысотаЭлемента",2);
		Состояние=ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
	КонецЕсли;
	
	Если Состояние<>Неопределено Тогда 
		СтароеСостояние=Объект.Состояние;
		Объект.Состояние=Состояние;
		Модифицированность=Истина;
		//Если НЕ ИзменитьСостояние() Тогда Объект.Состояние=СтароеСостояние КонецЕсли;
	КонецЕсли;
	УправлениеЭлементами();
КонецПроцедуры

//&НаКлиенте
//Процедура кнКалькулятор(Команда)
//	Если Не ЗначениеЗаполнено(Объект.КредитноеПредложение) Тогда
//		Результат=Вопрос("Не выбрано кредитное предложение. Выполнить произвольный рассчет кредита?", РежимДиалогаВопрос.ДаНет,,,"Внимание!");
//		Если Результат=КодВозвратаДиалога.Да Тогда
//			Обработка=Обработки.Renault_КредитныйКалькулятор.Создать();
//			Обработка.ПервыйВзносРубли=Объект.ПервоначальныйВзнос;
//			Обработка.СрокКредита=Объект.Срок;
//			Обработка.Стоимость=Объект.ЦенаАвтомобиля;
//			Обработка.ПолучитьФорму().Открыть();
//		КонецЕсли;
//	Иначе
//		Обработка=Обработки.Renault_КредитныйКалькулятор.Создать();
//		Обработка.ПервыйВзносРубли=Объект.ПервоначальныйВзнос;
//		Обработка.СрокКредита=Объект.Срок;
//		Обработка.Стоимость=Объект.ЦенаАвтомобиля;
//		Обработка.КредитноеПредложение=Объект.КредитноеПредложение;
//		Результат=Обработка.ПолучитьФорму().ОткрытьМодально();
//		Объект.ПервоначальныйВзнос=Результат.ПервоначальныйВзнос;
//		Объект.Срок=Результат.Срок;
//		Объект.Ставка=Результат.Ставка;
//		Объект.Сумма=Объект.ЦенаАвтомобиля-Объект.ПервоначальныйВзнос;
//	КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура КредитноеПредложениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Объект.КредитноеПредложение=ОткрытьФормуМодально("Справочник.Renault_КредитныеПредложения.ФормаВыбора",Новый Структура("РежимВыбора,Модель,Банк",Истина,Объект.Автомобиль,Объект.Банк),ЭтаФорма);
	Объект.Банк=Объект.КредитноеПредложение.Владелец;
	Объект.СрокКредита=Объект.КредитноеПредложение.СрокПоУмолчанию;
	Объект.СтавкаБанка=Объект.КредитноеПредложение.СтавкаПоУмолчанию;
КонецПроцедуры

&НаКлиенте
Процедура ПервоначальныйВзносПроцентПриИзменении(Элемент)
	Объект.ПервоначальныйВзнос=Объект.СтоимостьАвтомобиля*Объект.ПервоначальныйВзносПроцент/100;
КонецПроцедуры
&НаКлиенте
Процедура ПервоначальныйВзносПриИзменении(Элемент)
	Объект.ПервоначальныйВзносПроцент=Объект.ПервоначальныйВзнос*100/Объект.СтоимостьАвтомобиля;
КонецПроцедуры

&НаКлиенте
Процедура РабочийЛистНажатие(Элемент, СтандартнаяОбработка) СтандартнаяОбработка=Ложь; Renault_CRM.ОткрытьФормуРЛ(Объект.РабочийЛист) КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	Если ТипЗнч(Объект.Автомобиль)<>Тип("СправочникСсылка.Модели") Тогда Объект.Версия="" КонецЕсли;
	УправлениеЭлементами() 
КонецПроцедуры

//&НаКлиенте
//Процедура БанкПредоставляющийКредитПриИзменении(Элемент) УправлениеЭлементами() КонецПроцедуры
